---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailJoinOption
source: html/d2cac626-333b-3d29-0317-7f298b30270a.htm
---
# Autodesk.Revit.DB.Architecture.RailJoinOption

The join type of the system rails.

## Syntax (C#)
```csharp
public enum RailJoinOption
```